Revit 2016 API
ExportLayerTable.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLayerKey, ExportLayerInfo))
Visual C++
public:
virtual IEnumerator<KeyValuePair<ExportLayerKey^, ExportLayerInfo^>>^ GetEnumerator()
Return Value
An IEnumerator( KeyValuePair(ExportLayerKey^,ExportLayerInfo^) ) object that can be used to iterate through key-value pairs in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace